export interface HomeItem {
  id: string;
  title: string;
  image: string;
  description: string;
  details: string; 
}

export const featuredItems: HomeItem[] = [
  {
    id: 'smartphones',
    title: 'სმარტფონები',
    image: '/photo-18.webp',
    description: 'უახლესი მოდელები საუკეთესო ფასებით. Samsung, Apple, Xiaomi და სხვა.',
    details: 'აქვს 6.8-ინჩიანი Dynamic AMOLED 2X დისპლეი. ის გამოირჩევა ძალიან მაღალი სიკაშკაშით და სპეციალური ანტი-რეკლეფქსური (შუქის ამრეკლავი) შუშით, რაც მზეზე გამოყენებას ძალიან კომფორტულს ხდის.',
  },
  {
    id: 'laptops',
    title: 'ლეპტოპები',
    image: '/photo-10.webp',
    description: 'მძლავრი ლეპტოპები სამუშაოდ და გასართობად. ყველა ბრენდი ერთ ადგილას.',
    details: 'არ აქვს შიდა ვენტილატორი (ქულერი). შესაბამისად, მუშაობს აბსოლუტურად უხმოდ, თუმცა ძალიან მძიმე დატვირთვისას (მაგ. დიდი ვიდეოს რენდერი) შეიძლება ოდნავ გახურდეს.',
  },
  {
    id: 'accessories',
    title: 'აქსესუარები',
    image: '/photo-19.webp',
    description: 'ყურსასმენები, დამტენები, ქეისები და სხვა აქსესუარები.',
    details: 'ეს არის ინდუსტრიის სტანდარტი, როდესაც საქმე ხარისხიან ჟღერადობასა და იზოლაციას ეხება. ხშირად ყიდულობენ მოგზაურები, პროგრამისტები და მუსიკის მოყვარულები.',
  },
];

export const serviceItems: HomeItem[] = [
  {
    id: 'free-delivery',
    title: 'დაბალ ფასად მიწოდება',
    image: '/mart.webp',
    description: '50 ლარზე მეტი შეკვეთისას მიწოდება უფასოა საქართველოს მასშტაბით.',
    details: 'ონლაინ ყიდვისას გაუთვალისწინებელი დამატებითი ხარჯები ყოველთვის უსიამოვნოა. ამიტომ, ჩვენ გთავაზობთ დაბალ ფასად მიწოდება . მიუხედავად იმისა, თუ სად იმყოფებით – თბილისში თუ რეგიონებში,კურიერები თქვენს შენაძენს უსაფრთხოდ და მაქსიმალურად მოკლე დროში მოგაწვდიან პირდაპირ კართან.არანაირი ფარული გადასახადი – თქვენ იხდით მხოლოდ იმას, რასაც ეკრანზე ხედავთ.',
  },
  {
    id: 'warranty',
    title: 'გარანტია',
    image: '/photo-16.webp',
    description: 'ყველა პროდუქტზე მოქმედებს ოფიციალური გარანტია 1 წლიდან 3 წლამდე.',
    details: 'ჩვენთვის უმნიშვნელოვანესია, რომ თითოეული მომხმარებელი შენაძენით კმაყოფილი დარჩეს. ყველა პროდუქტი გადის ხარისხის მკაცრ კონტროლს, სანამ თქვენამდე მოაღწევს. თუმცა, თუ რაიმე მიზეზით ნივთმა არ გაამართლა თქვენი მოლოდინი , არ იდარდოთ! ჩვენი მოქნილი დაბრუნებისა და გადაცვლის პოლიტიკა გაძლევთ სრულ გარანტიას, რომ თქვენი თანხა დაცულია. ჩვენთან პროდუქტების შეძენა ყოველთვის უსაფრთხოა.',
  },
  {
    id: 'support-24-7',
    title: '24/7 მხარდაჭერა',
    image: '/photo-17.webp',
    description: 'ჩვენი გუნდი მზადაა დაგეხმაროთ ნებისმიერ დროს. დაგვიკავშირდით!',
    details: ' ჩვენი მომხმარებელთა ზრუნვის გუნდი თქვენს განკარგულებაშია კვირაში 7 დღე, დღე-ღამის ნებისმიერ მონაკვეთში. გჭირდებათ დახმარება პროდუქტის შერჩევაში, ტექნიკური მახასიათებლების დაზუსტება თუ უბრალოდ შეკვეთის სტატუსის გაგება გსურთ? მოგვწერეთ ჩატში ან გამოგვიგზავნეთ ელ-ფოსტა – ჩვენი გუნდი მუდამ მზადაა, გაგიწიოთ სწრაფი, პროფესიონალური დახმარება.',
  },
];

export const allHomeItems = [...featuredItems, ...serviceItems];
